src/test/java/samplefile/104-iss2hce-解挂rsp.txt

<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope">
   <soap:Header>
      <Action xmlns="http://www.w3.org/2005/08/addressing">http://globalplatform.org/globalservicemanagement/GlobalServiceManagement/SuspendOrResumeService</Action>
      <MessageID xmlns="http://www.w3.org/2005/08/addressing">20150725171649384027</MessageID>
      <To xmlns="http://www.w3.org/2005/08/addressing">https://9.234.250.232:8085/wsgw/ws</To>
      <ReplyTo xmlns="http://www.w3.org/2005/08/addressing">
         <Address>http://www.w3.org/2005/08/addressing/none</Address>
      </ReplyTo>
   </soap:Header>
   <soap:Body>
      <SuspendOrResumeServiceRequest xmlns="http://namespaces.globalplatform.org/systems-messaging/2.1.0" xmlns:ns2="http://www.w3.org/2000/09/xmldsig#" xmlns:ns3="http://www.gi-de.com/gd-extionsion-1.0.0" xmlns:ns4="http://namespaces.globalplatform.org/systems-profiles/1.1.2">
         <FunctionCallIdentifier>64083300</FunctionCallIdentifier>
         <ValidityPeriod>1</ValidityPeriod>
         <Extensions>
            <ns3:EntityInfo>
               <ns3:EntityType>TOKEN_PAN</ns3:EntityType>
               <ns3:Value>6251640000020016480</ns3:Value>
               <ns3:OperationReason>LOST_FOUND</ns3:OperationReason>
            </ns3:EntityInfo>
         </Extensions>
         <SuspensionControl>false</SuspensionControl>
      </SuspendOrResumeServiceRequest>
   </soap:Body>
</soap:Envelope>